public_html/Linux/configuration.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2020-05-21 Thu 02:53 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Linux Configuration Notes</title>
<meta name="generator" content="Org mode">
<meta name="author" content="leabravo">
<meta name="description" content="Tips &amp; Tricks for making your life easier when publishing blogs with emacs on minimum steroids."
>
<meta property="og:title" content="org-publish Tips & Tricks" />
<meta property="og:description" content="Linux Configuration Notes." />
<meta property="og:type" content="website" />
<link rel="stylesheet" type="text/css" href="/css/style.css" />
</head>
<body>
<div id="content">
<header>
<h1 class="title">Linux Configuration Notes</h1>
</header><nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orga4cce26">1. Networking</a>
<ul>
<li><a href="#org1c5d154">1.1. l2tp over IPsec</a></li>
</ul>
</li>
<li><a href="#org7e12c51">2. Peripherals</a>
<ul>
<li><a href="#org2a69477">2.1. Printer</a></li>
</ul>
</li>
<li><a href="#orgd2eeb6e">3. Video</a>
<ul>
<li><a href="#org0ad9c9e">3.1. GPU</a></li>
</ul>
</li>
</ul>
</div>
</nav>
<nil id="outline-container-orga4cce26" class="outline-2">
<h2 id="orga4cce26"><span class="section-number-2">1</span> Networking</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org1c5d154" class="outline-3">
<h3 id="org1c5d154"><span class="section-number-3">1.1</span> l2tp over IPsec</h3>
<div class="outline-text-3" id="text-1-1">
<p>
workaround to make the VPN work on Ubuntu 19.04, using network-manager-l2tp 1.2.10-1
</p>
<pre class="example">
$ sudo apt install network-manager-l2tp network-manager-strongswan strongswan-libcharon strongswan-nm
$ sudo service xl2tpd stop
$ sudo update-rc.d xl2tpd disable
</pre>
</div>
</div>
</nil>

<nil id="outline-container-org7e12c51" class="outline-2">
<h2 id="org7e12c51"><span class="section-number-2">2</span> Peripherals</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org2a69477" class="outline-3">
<h3 id="org2a69477"><span class="section-number-3">2.1</span> Printer</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>Network Printer</li>
</ul>
<p>
<a href='https://linuxhint.com/install_network_printers_linux/' rel='external nofollow'>tutorial</a>
</p>
</div>
</div>
</nil>

<nil id="outline-container-orgd2eeb6e" class="outline-2">
<h2 id="orgd2eeb6e"><span class="section-number-2">3</span> Video</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org0ad9c9e" class="outline-3">
<h3 id="org0ad9c9e"><span class="section-number-3">3.1</span> GPU</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Choose the model from the <a href='https://www.nvidia.com/Download/index.aspx?lang=en-us' rel='external nofollow'>NVIDIA drivers page</a> and choose Linux as the OS. On the next page, at the top the version of the driver will appear (i.e 435). Then you can go ahead and install the drivers.
</p>
<pre class="example">
$ sudo apt install nvidia-drivers-335
$ sudo nvidia-xconfig
</pre>
</div>
</div>
</nil>
</div>
<div id="postamble" class="status">
<p class="author">Author: leabravo</p>
<p class="date">Created: 2020-05-21 Thu 02:53</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
